#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_file.adb_wallet_file will be created
  + resource "local_file" "adb_wallet_file" {
      + content_base64       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./adb_wallet.zip"
      + id                   = (known after apply)
    }

  # oci_core_dhcp_options.DhcpOptions1 will be created
  + resource "oci_core_dhcp_options" "DhcpOptions1" {
      + compartment_id   = "ocid1.compartment.oc1..aaaaaaaaes3c3pxlxbcd2upv4vh7wbdfd7vgywuaa75izuu3otrb2omhekaa"
      + defined_tags     = (known after apply)
      + display_name     = "DHCPOptions1"
      + domain_name_type = (known after apply)
      + freeform_tags    = (known after apply)
      + id               = (known after apply)
      + state            = (known after apply)
      + time_created     = (known after apply)
      + vcn_id           = (known after apply)

      + options {
          + custom_dns_servers  = []
          + search_domain_names = (known after apply)
          + server_type         = "VcnLocalPlusInternet"
          + type                = "DomainNameServer"
        }
      + options {
          + custom_dns_servers  = []
          + search_domain_names = [
              + "example.com",
            ]
          + server_type         = (known after apply)
          + type                = "SearchDomain"
        }
    }

  # oci_core_instance.bastion_instance will be created
  + resource "oci_core_instance" "bastion_instance" {
      + availability_domain                 = "NoEK:UK-LONDON-1-AD-2"
      + boot_volume_id                      = (known after apply)
      + capacity_reservation_id             = (known after apply)
      + compartment_id                      = "ocid1.compartment.oc1..aaaaaaaaes3c3pxlxbcd2upv4vh7wbdfd7vgywuaa75izuu3otrb2omhekaa"
      + dedicated_vm_host_id                = (known after apply)
      + defined_tags                        = {
          + "CCA_Basic_Tag.email" = "oracleidentitycloudservice/paola.juarez@oracle.com"
        }
      + display_name                        = "atp-demo-bastion"
      + fault_domain                        = (known after apply)
      + freeform_tags                       = {
          + "Demo" = "COA Change Management Operations Demo"
        }
      + hostname_label                      = (known after apply)
      + id                                  = (known after apply)
      + image                               = (known after apply)
      + ipxe_script                         = (known after apply)
      + is_pv_encryption_in_transit_enabled = (known after apply)
      + launch_mode                         = (known after apply)
      + metadata                            = {
          + "ssh_authorized_keys" = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDLJp3uII85NDaLQ6DGCX6TsUDYy4QuA4fFlFQ+eidinSEAQYgFlSqBqgI/WW0acWOlaGhDwmWp0axSHOHEzKr0r56Q9Fkk7qKIONm/CYPZ34ntX2zTOxIoxxfLKeb6eOcFsTEAQ0DbLnwerrNO6UJ965Uo1QsrmnnpG6kgiMJswqr+osXnlBKGLmfEYbZCVhTiONd4SKxk0OLXLygeV+PLMfoWgwWK/d4uEs7HcRSIUsoAcLmS+NoBbm7wwGkrhsaq84k7hT2iX5ojFD4/Zw6woOOPhMl/ouL1DJRX/O2PbtuaSJPiLt+z8qfzyrKVLlQFoQyfDDnXt91x4KD1vFnXqWUWsYviIFtgHcFasppt3miS+qRrZFDyMsMPDoaWt0XuiknwWAzFhyZrFrGDXNEVqH9tWk2ls/EGKiBh55A2q8CjKp7IL0L/DTC+PWLPd+ABMHgEK9pee+A4vPUGYbBuRp8Kr+O/fF3hDfXdDvoJiMCIo7UMJcmB01RCGDr2ehE= pjuarez@pjuarez-mac"
        }
      + preserve_boot_volume                = false
      + private_ip                          = (known after apply)
      + public_ip                           = (known after apply)
      + region                              = (known after apply)
      + shape                               = "VM.Standard2.1"
      + state                               = (known after apply)
      + subnet_id                           = (known after apply)
      + system_tags                         = (known after apply)
      + time_created                        = (known after apply)
      + time_maintenance_reboot_due         = (known after apply)

      + agent_config {
          + are_all_plugins_disabled = (known after apply)
          + is_management_disabled   = (known after apply)
          + is_monitoring_disabled   = (known after apply)

          + plugins_config {
              + desired_state = (known after apply)
              + name          = (known after apply)
            }
        }

      + availability_config {
          + is_live_migration_preferred = (known after apply)
          + recovery_action             = (known after apply)
        }

      + create_vnic_details {
          + assign_public_ip       = "true"
          + defined_tags           = {
              + "CCA_Basic_Tag.email" = "oracleidentitycloudservice/paola.juarez@oracle.com"
            }
          + display_name           = "atp-demo-bastionvnic"
          + freeform_tags          = {
              + "Demo" = "COA Change Management Operations Demo"
            }
          + hostname_label         = "atp-demo-bastion"
          + private_ip             = (known after apply)
          + skip_source_dest_check = (known after apply)
          + subnet_id              = (known after apply)
          + vlan_id                = (known after apply)
        }

      + instance_options {
          + are_legacy_imds_endpoints_disabled = (known after apply)
        }

      + launch_options {
          + boot_volume_type                    = (known after apply)
          + firmware                            = (known after apply)
          + is_consistent_volume_naming_enabled = (known after apply)
          + is_pv_encryption_in_transit_enabled = (known after apply)
          + network_type                        = (known after apply)
          + remote_data_volume_type             = (known after apply)
        }

      + platform_config {
          + is_measured_boot_enabled           = (known after apply)
          + is_secure_boot_enabled             = (known after apply)
          + is_trusted_platform_module_enabled = (known after apply)
          + numa_nodes_per_socket              = (known after apply)
          + type                               = (known after apply)
        }

      + preemptible_instance_config {
          + preemption_action {
              + preserve_boot_volume = (known after apply)
              + type                 = (known after apply)
            }
        }

      + shape_config {
          + baseline_ocpu_utilization     = (known after apply)
          + gpu_description               = (known after apply)
          + gpus                          = (known after apply)
          + local_disk_description        = (known after apply)
          + local_disks                   = (known after apply)
          + local_disks_total_size_in_gbs = (known after apply)
          + max_vnic_attachments          = (known after apply)
          + memory_in_gbs                 = (known after apply)
          + networking_bandwidth_in_gbps  = (known after apply)
          + nvmes                         = (known after apply)
          + ocpus                         = (known after apply)
          + processor_description         = (known after apply)
        }

      + source_details {
          + boot_volume_size_in_gbs = (known after apply)
          + kms_key_id              = (known after apply)
          + source_id               = "ocid1.image.oc1.uk-london-1.aaaaaaaak73hc4densg5y3u5fynzc5fr5qnkbengjaccv2te6zdz3rtl5s5a"
          + source_type             = "image"
        }
    }

  # oci_core_internet_gateway.coa_internet_gateway will be created
  + resource "oci_core_internet_gateway" "coa_internet_gateway" {
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaaes3c3pxlxbcd2upv4vh7wbdfd7vgywuaa75izuu3otrb2omhekaa"
      + defined_tags   = {
          + "CCA_Basic_Tag.email" = "oracleidentitycloudservice/paola.juarez@oracle.com"
        }
      + display_name   = "atp-demo-IG"
      + enabled        = true
      + freeform_tags  = {
          + "Demo" = "COA Change Management Operations Demo"
        }
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)
    }

  # oci_core_nat_gateway.coa_nat_gateway will be created
  + resource "oci_core_nat_gateway" "coa_nat_gateway" {
      + block_traffic  = (known after apply)
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaaes3c3pxlxbcd2upv4vh7wbdfd7vgywuaa75izuu3otrb2omhekaa"
      + defined_tags   = {
          + "CCA_Basic_Tag.email" = "oracleidentitycloudservice/paola.juarez@oracle.com"
        }
      + display_name   = "atp-demo-NAT-GW"
      + freeform_tags  = {
          + "Demo" = "COA Change Management Operations Demo"
        }
      + id             = (known after apply)
      + nat_ip         = (known after apply)
      + public_ip_id   = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)
    }

  # oci_core_network_security_group.ATPSecurityGroup will be created
  + resource "oci_core_network_security_group" "ATPSecurityGroup" {
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaaes3c3pxlxbcd2upv4vh7wbdfd7vgywuaa75izuu3otrb2omhekaa"
      + defined_tags   = {
          + "CCA_Basic_Tag.email" = "oracleidentitycloudservice/paola.juarez@oracle.com"
        }
      + display_name   = "ATPSecurityGroup"
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)
    }

  # oci_core_network_security_group.SSHSecurityGroup will be created
  + resource "oci_core_network_security_group" "SSHSecurityGroup" {
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaaes3c3pxlxbcd2upv4vh7wbdfd7vgywuaa75izuu3otrb2omhekaa"
      + defined_tags   = {
          + "CCA_Basic_Tag.email" = "oracleidentitycloudservice/paola.juarez@oracle.com"
        }
      + display_name   = "SSHSecurityGroup"
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)
    }

  # oci_core_network_security_group.WebSecurityGroup will be created
  + resource "oci_core_network_security_group" "WebSecurityGroup" {
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaaes3c3pxlxbcd2upv4vh7wbdfd7vgywuaa75izuu3otrb2omhekaa"
      + defined_tags   = {
          + "CCA_Basic_Tag.email" = "oracleidentitycloudservice/paola.juarez@oracle.com"
        }
      + display_name   = "WebSecurityGroup"
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)
    }

  # oci_core_network_security_group_security_rule.ATPSecurityEgressGroupRule will be created
  + resource "oci_core_network_security_group_security_rule" "ATPSecurityEgressGroupRule" {
      + description               = (known after apply)
      + destination               = "10.0.0.0/16"
      + destination_type          = "CIDR_BLOCK"
      + direction                 = "EGRESS"
      + id                        = (known after apply)
      + is_valid                  = (known after apply)
      + network_security_group_id = (known after apply)
      + protocol                  = "6"
      + source_type               = (known after apply)
      + stateless                 = (known after apply)
      + time_created              = (known after apply)
    }

  # oci_core_network_security_group_security_rule.ATPSecurityIngressGroupRules will be created
  + resource "oci_core_network_security_group_security_rule" "ATPSecurityIngressGroupRules" {
      + description               = (known after apply)
      + destination               = (known after apply)
      + destination_type          = (known after apply)
      + direction                 = "INGRESS"
      + id                        = (known after apply)
      + is_valid                  = (known after apply)
      + network_security_group_id = (known after apply)
      + protocol                  = "6"
      + source                    = "10.0.0.0/16"
      + source_type               = "CIDR_BLOCK"
      + stateless                 = (known after apply)
      + time_created              = (known after apply)

      + tcp_options {
          + destination_port_range {
              + max = 1522
              + min = 1522
            }
        }
    }

  # oci_core_network_security_group_security_rule.SSHSecurityEgressGroupRule will be created
  + resource "oci_core_network_security_group_security_rule" "SSHSecurityEgressGroupRule" {
      + description               = (known after apply)
      + destination               = "0.0.0.0/0"
      + destination_type          = "CIDR_BLOCK"
      + direction                 = "EGRESS"
      + id                        = (known after apply)
      + is_valid                  = (known after apply)
      + network_security_group_id = (known after apply)
      + protocol                  = "6"
      + source_type               = (known after apply)
      + stateless                 = (known after apply)
      + time_created              = (known after apply)
    }

  # oci_core_network_security_group_security_rule.SSHSecurityIngressGroupRules will be created
  + resource "oci_core_network_security_group_security_rule" "SSHSecurityIngressGroupRules" {
      + description               = (known after apply)
      + destination               = (known after apply)
      + destination_type          = (known after apply)
      + direction                 = "INGRESS"
      + id                        = (known after apply)
      + is_valid                  = (known after apply)
      + network_security_group_id = (known after apply)
      + protocol                  = "6"
      + source                    = "0.0.0.0/0"
      + source_type               = "CIDR_BLOCK"
      + stateless                 = (known after apply)
      + time_created              = (known after apply)

      + tcp_options {
          + destination_port_range {
              + max = 22
              + min = 22
            }
        }
    }

  # oci_core_network_security_group_security_rule.WebSecurityEgressATPGroupRule will be created
  + resource "oci_core_network_security_group_security_rule" "WebSecurityEgressATPGroupRule" {
      + description               = (known after apply)
      + destination               = (known after apply)
      + destination_type          = "NETWORK_SECURITY_GROUP"
      + direction                 = "EGRESS"
      + id                        = (known after apply)
      + is_valid                  = (known after apply)
      + network_security_group_id = (known after apply)
      + protocol                  = "6"
      + source_type               = (known after apply)
      + stateless                 = (known after apply)
      + time_created              = (known after apply)
    }

  # oci_core_network_security_group_security_rule.WebSecurityEgressInternetGroupRule will be created
  + resource "oci_core_network_security_group_security_rule" "WebSecurityEgressInternetGroupRule" {
      + description               = (known after apply)
      + destination               = "0.0.0.0/0"
      + destination_type          = "CIDR_BLOCK"
      + direction                 = "EGRESS"
      + id                        = (known after apply)
      + is_valid                  = (known after apply)
      + network_security_group_id = (known after apply)
      + protocol                  = "6"
      + source_type               = (known after apply)
      + stateless                 = (known after apply)
      + time_created              = (known after apply)
    }

  # oci_core_network_security_group_security_rule.WebSecurityIngressGroupRules will be created
  + resource "oci_core_network_security_group_security_rule" "WebSecurityIngressGroupRules" {
      + description               = (known after apply)
      + destination               = (known after apply)
      + destination_type          = (known after apply)
      + direction                 = "INGRESS"
      + id                        = (known after apply)
      + is_valid                  = (known after apply)
      + network_security_group_id = (known after apply)
      + protocol                  = "6"
      + source                    = "0.0.0.0/0"
      + source_type               = "CIDR_BLOCK"
      + stateless                 = (known after apply)
      + time_created              = (known after apply)

      + tcp_options {
          + destination_port_range {
              + max = 80
              + min = 80
            }
        }
    }

  # oci_core_route_table.coa_ig_route_table will be created
  + resource "oci_core_route_table" "coa_ig_route_table" {
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaaes3c3pxlxbcd2upv4vh7wbdfd7vgywuaa75izuu3otrb2omhekaa"
      + defined_tags   = {
          + "CCA_Basic_Tag.email" = "oracleidentitycloudservice/paola.juarez@oracle.com"
        }
      + display_name   = "atp-demo-ig-route-table"
      + freeform_tags  = {
          + "Demo" = "COA Change Management Operations Demo"
        }
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)

      + route_rules {
          + cidr_block        = (known after apply)
          + description       = "Trafic to public internet to be routed through the IG"
          + destination       = "0.0.0.0/0"
          + destination_type  = "CIDR_BLOCK"
          + network_entity_id = (known after apply)
        }
    }

  # oci_core_route_table.coa_nat_gw_route_table will be created
  + resource "oci_core_route_table" "coa_nat_gw_route_table" {
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaaes3c3pxlxbcd2upv4vh7wbdfd7vgywuaa75izuu3otrb2omhekaa"
      + defined_tags   = {
          + "CCA_Basic_Tag.email" = "oracleidentitycloudservice/paola.juarez@oracle.com"
        }
      + display_name   = "atp-demo-nat-gw-route-table"
      + freeform_tags  = {
          + "Demo" = "COA Change Management Operations Demo"
        }
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)

      + route_rules {
          + cidr_block        = (known after apply)
          + description       = "Trafic to public internet to be routed through the NAT GW"
          + destination       = "0.0.0.0/0"
          + destination_type  = "CIDR_BLOCK"
          + network_entity_id = (known after apply)
        }
    }

  # oci_core_security_list.coa_atp_private_subnet_security_list will be created
  + resource "oci_core_security_list" "coa_atp_private_subnet_security_list" {
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaaes3c3pxlxbcd2upv4vh7wbdfd7vgywuaa75izuu3otrb2omhekaa"
      + defined_tags   = {
          + "CCA_Basic_Tag.email" = "oracleidentitycloudservice/paola.juarez@oracle.com"
        }
      + display_name   = "atp-demo-private_atp-subnet-security-list"
      + freeform_tags  = {
          + "Demo" = "COA Change Management Operations Demo"
        }
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)

      + ingress_security_rules {
          + description = "Allow ingress for listener from 10.0.0.0/16"
          + protocol    = "6"
          + source      = "10.0.0.0/16"
          + source_type = "CIDR_BLOCK"
          + stateless   = false

          + tcp_options {
              + max = 1522
              + min = 1522
            }
        }
    }

  # oci_core_security_list.coa_public_subnet_security_list will be created
  + resource "oci_core_security_list" "coa_public_subnet_security_list" {
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaaes3c3pxlxbcd2upv4vh7wbdfd7vgywuaa75izuu3otrb2omhekaa"
      + defined_tags   = {
          + "CCA_Basic_Tag.email" = "oracleidentitycloudservice/paola.juarez@oracle.com"
        }
      + display_name   = "atp-demo-public-subnet-security-list"
      + freeform_tags  = {
          + "Demo" = "COA Change Management Operations Demo"
        }
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)
    }

  # oci_core_security_list.coa_vcn_security_list will be created
  + resource "oci_core_security_list" "coa_vcn_security_list" {
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaaes3c3pxlxbcd2upv4vh7wbdfd7vgywuaa75izuu3otrb2omhekaa"
      + defined_tags   = {
          + "CCA_Basic_Tag.email" = "oracleidentitycloudservice/paola.juarez@oracle.com"
        }
      + display_name   = "atp-demo-vcn-security-list"
      + freeform_tags  = {
          + "Demo" = "COA Change Management Operations Demo"
        }
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)

      + egress_security_rules {
          + description      = "egress to anywhere"
          + destination      = "0.0.0.0/0"
          + destination_type = "CIDR_BLOCK"
          + protocol         = "all"
          + stateless        = false
        }

      + ingress_security_rules {
          + description = "Allow ingress for SSH:22 from anywhere"
          + protocol    = "6"
          + source      = "0.0.0.0/0"
          + source_type = "CIDR_BLOCK"
          + stateless   = false

          + tcp_options {
              + max = 22
              + min = 22
            }
        }
      + ingress_security_rules {
          + description = "Ping from inside the vcn"
          + protocol    = "1"
          + source      = "10.0.0.0/16"
          + source_type = "CIDR_BLOCK"
          + stateless   = false

          + icmp_options {
              + code = -1
              + type = 3
            }
        }
      + ingress_security_rules {
          + description = "ping from anywhere"
          + protocol    = "1"
          + source      = "0.0.0.0/0"
          + source_type = "CIDR_BLOCK"
          + stateless   = false

          + icmp_options {
              + code = 4
              + type = 3
            }
        }
    }

  # oci_core_subnet.coa_atp_private_subnet will be created
  + resource "oci_core_subnet" "coa_atp_private_subnet" {
      + availability_domain        = (known after apply)
      + cidr_block                 = "10.0.11.0/24"
      + compartment_id             = "ocid1.compartment.oc1..aaaaaaaaes3c3pxlxbcd2upv4vh7wbdfd7vgywuaa75izuu3otrb2omhekaa"
      + defined_tags               = (known after apply)
      + dhcp_options_id            = (known after apply)
      + display_name               = "atp-demo-atp_private-subnet"
      + dns_label                  = "atpprivsubnet"
      + freeform_tags              = {
          + "Demo" = "COA Change Management Operations Demo"
        }
      + id                         = (known after apply)
      + ipv6cidr_block             = (known after apply)
      + ipv6cidr_blocks            = (known after apply)
      + ipv6virtual_router_ip      = (known after apply)
      + prohibit_internet_ingress  = (known after apply)
      + prohibit_public_ip_on_vnic = true
      + route_table_id             = (known after apply)
      + security_list_ids          = (known after apply)
      + state                      = (known after apply)
      + subnet_domain_name         = (known after apply)
      + time_created               = (known after apply)
      + vcn_id                     = (known after apply)
      + virtual_router_ip          = (known after apply)
      + virtual_router_mac         = (known after apply)
    }

  # oci_core_subnet.coa_public_subnet will be created
  + resource "oci_core_subnet" "coa_public_subnet" {
      + availability_domain        = (known after apply)
      + cidr_block                 = "10.0.10.0/24"
      + compartment_id             = "ocid1.compartment.oc1..aaaaaaaaes3c3pxlxbcd2upv4vh7wbdfd7vgywuaa75izuu3otrb2omhekaa"
      + defined_tags               = {
          + "CCA_Basic_Tag.email" = "oracleidentitycloudservice/paola.juarez@oracle.com"
        }
      + dhcp_options_id            = (known after apply)
      + display_name               = "atp-demo-public-subnet"
      + dns_label                  = "pubsubnet"
      + freeform_tags              = {
          + "Demo" = "COA Change Management Operations Demo"
        }
      + id                         = (known after apply)
      + ipv6cidr_block             = (known after apply)
      + ipv6cidr_blocks            = (known after apply)
      + ipv6virtual_router_ip      = (known after apply)
      + prohibit_internet_ingress  = (known after apply)
      + prohibit_public_ip_on_vnic = (known after apply)
      + route_table_id             = (known after apply)
      + security_list_ids          = (known after apply)
      + state                      = (known after apply)
      + subnet_domain_name         = (known after apply)
      + time_created               = (known after apply)
      + vcn_id                     = (known after apply)
      + virtual_router_ip          = (known after apply)
      + virtual_router_mac         = (known after apply)
    }

  # oci_core_vcn.coa_demo_vcn will be created
  + resource "oci_core_vcn" "coa_demo_vcn" {
      + byoipv6cidr_blocks               = (known after apply)
      + cidr_block                       = "10.0.0.0/16"
      + cidr_blocks                      = (known after apply)
      + compartment_id                   = "ocid1.compartment.oc1..aaaaaaaaes3c3pxlxbcd2upv4vh7wbdfd7vgywuaa75izuu3otrb2omhekaa"
      + default_dhcp_options_id          = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_list_id         = (known after apply)
      + defined_tags                     = {
          + "CCA_Basic_Tag.email" = "oracleidentitycloudservice/paola.juarez@oracle.com"
        }
      + display_name                     = "atp-demo-vcn"
      + dns_label                        = "coavcn"
      + freeform_tags                    = {
          + "Demo" = "COA Change Management Operations Demo"
        }
      + id                               = (known after apply)
      + ipv6cidr_blocks                  = (known after apply)
      + ipv6private_cidr_blocks          = (known after apply)
      + is_ipv6enabled                   = false
      + is_oracle_gua_allocation_enabled = (known after apply)
      + state                            = (known after apply)
      + time_created                     = (known after apply)
      + vcn_domain_name                  = (known after apply)

      + byoipv6cidr_details {
          + byoipv6range_id = (known after apply)
          + ipv6cidr_block  = (known after apply)
        }
    }

  # oci_objectstorage_bucket.test_bucket will be created
  + resource "oci_objectstorage_bucket" "test_bucket" {
      + access_type                  = "NoPublicAccess"
      + approximate_count            = (known after apply)
      + approximate_size             = (known after apply)
      + auto_tiering                 = (known after apply)
      + bucket_id                    = (known after apply)
      + compartment_id               = "ocid1.compartment.oc1..aaaaaaaaes3c3pxlxbcd2upv4vh7wbdfd7vgywuaa75izuu3otrb2omhekaa"
      + created_by                   = (known after apply)
      + defined_tags                 = (known after apply)
      + etag                         = (known after apply)
      + freeform_tags                = (known after apply)
      + id                           = (known after apply)
      + is_read_only                 = (known after apply)
      + kms_key_id                   = (known after apply)
      + name                         = "atp-demo-bucket"
      + namespace                    = "frxfz3gch4zb"
      + object_events_enabled        = (known after apply)
      + object_lifecycle_policy_etag = (known after apply)
      + replication_enabled          = (known after apply)
      + storage_tier                 = (known after apply)
      + time_created                 = (known after apply)
      + versioning                   = (known after apply)
    }

  # module.adb.oci_database_autonomous_database.adb_database will be created
  + resource "oci_database_autonomous_database" "adb_database" {
      + actual_used_data_storage_size_in_tbs           = (known after apply)
      + admin_password                                 = (sensitive value)
      + allocated_storage_size_in_tbs                  = (known after apply)
      + apex_details                                   = (known after apply)
      + are_primary_whitelisted_ips_used               = (known after apply)
      + autonomous_container_database_id               = (known after apply)
      + autonomous_database_backup_id                  = (known after apply)
      + autonomous_database_id                         = (known after apply)
      + autonomous_maintenance_schedule_type           = "REGULAR"
      + available_upgrade_versions                     = (known after apply)
      + backup_config                                  = (known after apply)
      + clone_type                                     = (known after apply)
      + compartment_id                                 = "ocid1.compartment.oc1..aaaaaaaaes3c3pxlxbcd2upv4vh7wbdfd7vgywuaa75izuu3otrb2omhekaa"
      + connection_strings                             = (known after apply)
      + connection_urls                                = (known after apply)
      + cpu_core_count                                 = 1
      + data_safe_status                               = "NOT_REGISTERED"
      + data_storage_size_in_gb                        = (known after apply)
      + data_storage_size_in_tbs                       = 1
      + database_edition                               = (known after apply)
      + database_management_status                     = (known after apply)
      + dataguard_region_type                          = (known after apply)
      + db_name                                        = "ADBCOADEMO2"
      + db_version                                     = "19c"
      + db_workload                                    = "OLTP"
      + defined_tags                                   = (known after apply)
      + display_name                                   = "ADBCOADEMO2"
      + failed_data_recovery_in_seconds                = (known after apply)
      + freeform_tags                                  = (known after apply)
      + id                                             = (known after apply)
      + infrastructure_type                            = (known after apply)
      + is_access_control_enabled                      = (known after apply)
      + is_auto_scaling_enabled                        = true
      + is_auto_scaling_for_storage_enabled            = (known after apply)
      + is_data_guard_enabled                          = false
      + is_dedicated                                   = false
      + is_free_tier                                   = false
      + is_mtls_connection_required                    = true
      + is_preview                                     = (known after apply)
      + is_preview_version_with_service_terms_accepted = (known after apply)
      + is_reconnect_clone_enabled                     = (known after apply)
      + is_refreshable_clone                           = (known after apply)
      + key_history_entry                              = (known after apply)
      + key_store_id                                   = (known after apply)
      + key_store_wallet_name                          = (known after apply)
      + kms_key_id                                     = (known after apply)
      + kms_key_lifecycle_details                      = (known after apply)
      + kms_key_version_id                             = (known after apply)
      + license_model                                  = "BRING_YOUR_OWN_LICENSE"
      + lifecycle_details                              = (known after apply)
      + max_cpu_core_count                             = (known after apply)
      + memory_per_oracle_compute_unit_in_gbs          = (known after apply)
      + nsg_ids                                        = (known after apply)
      + ocpu_count                                     = (known after apply)
      + open_mode                                      = (known after apply)
      + operations_insights_status                     = "NOT_ENABLED"
      + peer_db_ids                                    = (known after apply)
      + permission_level                               = (known after apply)
      + private_endpoint                               = (known after apply)
      + private_endpoint_ip                            = (known after apply)
      + private_endpoint_label                         = "ADBCOADEMO2"
      + provisionable_cpus                             = (known after apply)
      + refreshable_mode                               = (known after apply)
      + refreshable_status                             = (known after apply)
      + role                                           = (known after apply)
      + service_console_url                            = (known after apply)
      + source                                         = (known after apply)
      + source_id                                      = (known after apply)
      + standby_db                                     = (known after apply)
      + standby_whitelisted_ips                        = []
      + state                                          = "AVAILABLE"
      + subnet_id                                      = (known after apply)
      + supported_regions_to_clone_to                  = (known after apply)
      + system_tags                                    = (known after apply)
      + time_created                                   = (known after apply)
      + time_data_guard_role_changed                   = (known after apply)
      + time_deletion_of_free_autonomous_database      = (known after apply)
      + time_local_data_guard_enabled                  = (known after apply)
      + time_maintenance_begin                         = (known after apply)
      + time_maintenance_end                           = (known after apply)
      + time_of_last_failover                          = (known after apply)
      + time_of_last_refresh                           = (known after apply)
      + time_of_last_refresh_point                     = (known after apply)
      + time_of_last_switchover                        = (known after apply)
      + time_of_next_refresh                           = (known after apply)
      + time_reclamation_of_free_autonomous_database   = (known after apply)
      + time_until_reconnect_clone_enabled             = (known after apply)
      + timestamp                                      = (known after apply)
      + used_data_storage_size_in_tbs                  = (known after apply)
      + vault_id                                       = (known after apply)

      + customer_contacts {
          + email = (known after apply)
        }

      + scheduled_operations {
          + scheduled_start_time = (known after apply)
          + scheduled_stop_time  = (known after apply)

          + day_of_week {
              + name = (known after apply)
            }
        }
    }

  # module.adb.oci_database_autonomous_database_wallet.adb_database_wallet will be created
  + resource "oci_database_autonomous_database_wallet" "adb_database_wallet" {
      + autonomous_database_id = (known after apply)
      + base64_encode_content  = true
      + content                = (known after apply)
      + generate_type          = "SINGLE"
      + id                     = (known after apply)
      + password               = (sensitive value)
    }

  # module.adb.random_password.wallet_password will be created
  + resource "random_password" "wallet_password" {
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 2
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

Plan: 27 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + COA_Demo_Details = {
      + adb               = [
          + (known after apply),
        ]
      + automation_run_by = "oracleidentitycloudservice/paola.juarez@oracle.com"
      + bucketname        = null
      + cpu               = [
          + 1,
        ]
      + region            = "uk-london-1"
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @paolajuarezgomez, Action: `pull_request`*